УТ_11_4.Umico/src/Documents/СписаниеЗадолженности/СписаниеЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="537a6fca-6e71-4d20-9df7-dc2b2acb57d9">
  <name>СписаниеЗадолженности</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="67150349-91ac-48ca-9357-94a09e7c7188">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3b8ea432-e117-4c64-bd86-28a6ee4b5ece">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="5058cd20-2337-4901-a724-e1d7fea5c561">
    <name>РасчетыМеждуОрганизациями</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e3cc8f24-615f-49ae-aa18-c7bb31d1a830">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f0c1e64b-e7e5-44a0-b2cf-2be9d5da177e">
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e43f7478-7f0d-49ed-9451-e782ea65981c">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="da1d134e-69be-4f46-a30d-1ab674350f9e">
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="55302c30-ead2-44cc-9899-dd9b4fcc8bd5">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a088b6dc-0fd3-43ac-a5cf-8c0d01538b90">
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="4dc56a88-e4d8-4609-9115-108eb2604707">
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c448dd7b-c221-41b5-adbe-d916722b68dc">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="7388c1e5-c629-496d-bb4f-992c2f41edd4">
    <name>Задолженность</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9fd1ef31-9093-4884-94d0-67a5fe37d40a">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="349700ae-af74-4259-a486-c3f9a9071263">
      <name>ТипРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.ТипыРасчетовСПартнерами</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="e4f957d5-61f1-41b8-8718-e4223987ad9d">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="513e3984-793d-4164-9edd-094846384270">
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ОбъектРасчетов</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="c4f34db8-2a8b-4f38-a34e-030ceb73f050">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d446b19a-b079-4643-b5cf-2d35e6dbe526">
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_11_4.Umico/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2ac23005-c54f-421a-add8-7227d22cdeea">
  <name>РасчетыСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <dimensions extendedConfigurationObject="b669e898-2a3e-4b99-adb4-753e8d178728">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ОбъектРасчетовСКлиентами</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="d320b33c-395d-45d0-a059-6ebb69d4403c">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_11_4.Umico/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="4dec627e-3939-4191-a213-0cea734fc86c">
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a606d3e5-4a59-4b2c-9d3d-5976f5c778cf">
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3299776f-a304-476e-a0d9-a9132b128869">
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0789d7c2-8020-4d52-a305-445f9faa9b76">
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="86226876-65c7-4914-82f8-c5cfbea3ed56">
    <name>ВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="863611ce-77e7-4290-8d3d-b27ddb7ba9fa">
    <name>ВозвратОтКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="758b500d-bfac-442d-89c5-63d856f65d39">
    <name>ВозвратОтРозничногоПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="733cca42-63ac-4b08-87d9-90abec9c03ec">
    <name>СписаниеКредиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae5b97e9-6e3e-40da-af52-695ba210a200">
    <name>СписаниеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_11_4.Umico/src/Enums/ТипыРасчетовСПартнерами/ТипыРасчетовСПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0d6d53c9-63ee-44f8-8520-8cb643b1df21">
  <name>ТипыРасчетовСПартнерами</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="115f7bfa-174a-4de6-8149-8a0aa21cb6ea">
    <name>РасчетыСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2efefc30-c158-4305-8f41-1131dfd4b818">
    <name>РасчетыСКлиентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_11_4.Umico/src/Documents/СписаниеЗадолженности/ObjectModule.bsl
// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура UMC_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	UMC_СтруктураЗаполнения = ДанныеЗаполнения; // см. UMC_ОбменСUmico.НоваяСтруктураЗаполненияСписания
	
	UMC_СписаниеЗаСчетUmico = Ложь;
	
	UMC_СтруктураЗаполнения.Свойство("СписаниеЗаСчетUmico", UMC_СписаниеЗаСчетUmico);
	
	Если UMC_СписаниеЗаСчетUmico = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	UMC_Основание = UMC_СтруктураЗаполнения.Основание;
	
	UMC_Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(UMC_Основание, "Организация, Контрагент, Партнер, UMC_ОплаченноБалламиUmico");
	
	Организация = UMC_Реквизиты.Организация;
	Контрагент = UMC_Реквизиты.Контрагент;
	
	Если ТипЗнч(UMC_Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;
	ИначеЕсли ТипЗнч(UMC_Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности;
	КонецЕсли;
	
	UMC_Выборка = UMC_ПолучитьСведенияОРасчетахСКлиентамиПоОснованию(UMC_Основание);
	Если UMC_Выборка.Следующий() Тогда
		UMC_НоваяСтрока = Задолженность.Добавить();	
		UMC_НоваяСтрока.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
		UMC_НоваяСтрока.Партнер = UMC_Реквизиты.Партнер;
		UMC_НоваяСтрока.Заказ = UMC_Выборка.ЗаказКлиента;
		UMC_НоваяСтрока.ВалютаВзаиморасчетов = UMC_Выборка.Валюта;
		UMC_НоваяСтрока.Сумма = UMC_Реквизиты.UMC_ОплаченноБалламиUmico;
		UMC_НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить сведения о расчетах с клиентами по основанию.
// 
// Параметры:
//  UMC_Основание - ДокументСсылка.РеализацияТоваровУслуг - UMC основание
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//	* ЗаказКлиента - ОпределяемыйТип.ОбъектРасчетов
//	* Валюта - СправочникСсылка.Валюты
Функция UMC_ПолучитьСведенияОРасчетахСКлиентамиПоОснованию(UMC_Основание)

	UMC_Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						  |	РасчетыСКлиентами.ЗаказКлиента,
						  |	РасчетыСКлиентами.Валюта
						  |ИЗ
						  |	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
						  |ГДЕ
						  |	РасчетыСКлиентами.Регистратор = &Регистратор");
	UMC_Запрос.УстановитьПараметр("Регистратор", UMC_Основание);

	Возврат UMC_Запрос.Выполнить().Выбрать();

КонецФункции

#КонецОбласти

#КонецЕсли
